
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 0 to change, 10 to destroy.</code></pre>

* Create
  * google_service_account.terraform_executor
  * google_service_account_iam_binding.terraform_workload_identity
  * kubernetes_cluster_role.access_pjtester_secrets_trusted_workloads
  * kubernetes_cluster_role.access_signify_secrets_trusted_workloads
  * kubernetes_cluster_role.access_signify_secrets_untrusted_workloads
  * kubernetes_cluster_role_binding.access_pjtester_secrets_trusted_workloads
  * kubernetes_cluster_role_binding.access_signify_prod_secret_trusted_workloads
  * kubernetes_cluster_role_binding.access_signify_prod_secret_untrusted_workloads
  * kubernetes_service_account.trusted_workload_terraform_executor
  * kubernetes_service_account.untrusted_workload_terraform_executor
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \&#34;eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\&#34;\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - &#39;--name=*&#39;\n          - &#39;--config=*&#39;\n          - &#39;--context=*&#39;\n          - &#39;--dockerfile=*&#39;\n          - --log-dir=/\n      - image: \&#34;gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\&#34;\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \&#34;eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\&#34;\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - &#39;--name=*&#39;\n          - &#39;--config=*&#39;\n          - &#39;--context=*&#39;\n          - &#39;--dockerfile=*&#39;\n          - --log-dir=/\n      - image: \&#34;gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\&#34;\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image&#34;]
* Delete
  * module.tekton_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
  * module.tekton_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor
  * module.terraform_executor_gcp_service_account.google_project_iam_member.terraform_executor_owner
  * module.terraform_executor_gcp_service_account.google_service_account.terraform_executor
  * module.terraform_executor_gcp_service_account.google_service_account_iam_binding.terraform_workload_identity
  * module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
  * module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor
  * module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor
  * module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor
* Replace
  * google_project_iam_member.terraform_executor_owner


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_iam_member.terraform_executor_owner must be replaced
-/+ resource "google_project_iam_member" "terraform_executor_owner" {
      ~ etag    = "BwX+pK6YmJk=" -> (known after apply)
      ~ id      = "sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply) # forces replacement
      ~ project = "sap-kyma-prow-workloads" -> "sap-kyma-prow" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # google_service_account.terraform_executor will be created
  + resource "google_service_account" "terraform_executor" {
      + account_id   = "terraform-executor"
      + description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity."
      + disabled     = false
      + display_name = "terraform-executor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.terraform_workload_identity will be created
  + resource "google_service_account_iam_binding" "terraform_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:sap-kyma-prow.svc.id.goog[default/terraform-executor]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # kubernetes_cluster_role.access_pjtester_secrets_trusted_workloads will be created
  + resource "kubernetes_cluster_role" "access_pjtester_secrets_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-pjtester-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups     = [
              + "",
            ]
          + resource_names = [
              + "pjtester-kubeconfig",
              + "pjtester-github-oauth-token",
            ]
          + resources      = [
              + "secrets",
            ]
          + verbs          = [
              + "update",
              + "get",
              + "list",
              + "watch",
              + "patch",
              + "create",
              + "delete",
            ]
        }
    }

  # kubernetes_cluster_role.access_signify_secrets_trusted_workloads will be created
  + resource "kubernetes_cluster_role" "access_signify_secrets_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-signify-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups     = [
              + "",
            ]
          + resource_names = [
              + "signify-dev-secret",
              + "signify-prod-secret",
            ]
          + resources      = [
              + "secrets",
            ]
          + verbs          = [
              + "update",
              + "get",
              + "list",
              + "watch",
              + "patch",
              + "create",
              + "delete",
            ]
        }
    }

  # kubernetes_cluster_role.access_signify_secrets_untrusted_workloads will be created
  + resource "kubernetes_cluster_role" "access_signify_secrets_untrusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-signify-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups     = [
              + "",
            ]
          + resource_names = [
              + "signify-dev-secret",
              + "signify-prod-secret",
            ]
          + resources      = [
              + "secrets",
            ]
          + verbs          = [
              + "update",
              + "get",
              + "list",
              + "watch",
              + "patch",
              + "create",
              + "delete",
            ]
        }
    }

  # kubernetes_cluster_role_binding.access_pjtester_secrets_trusted_workloads will be created
  + resource "kubernetes_cluster_role_binding" "access_pjtester_secrets_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-pjtester-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "access-pjtester-secrets"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "secret-manager-trusted"
          + namespace = "external-secrets"
        }
    }

  # kubernetes_cluster_role_binding.access_signify_prod_secret_trusted_workloads will be created
  + resource "kubernetes_cluster_role_binding" "access_signify_prod_secret_trusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-signify-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "access-signify-secrets"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "secret-manager-trusted"
          + namespace = "external-secrets"
        }
    }

  # kubernetes_cluster_role_binding.access_signify_prod_secret_untrusted_workloads will be created
  + resource "kubernetes_cluster_role_binding" "access_signify_prod_secret_untrusted_workloads" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "access-signify-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "access-signify-secrets"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "secret-manager-trusted"
          + namespace = "external-secrets"
        }
    }

  # kubernetes_service_account.trusted_workload_terraform_executor will be created
  + resource "kubernetes_service_account" "trusted_workload_terraform_executor" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "terraform-executor"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.untrusted_workload_terraform_executor will be created
  + resource "kubernetes_service_account" "untrusted_workload_terraform_executor" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "terraform-executor"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.tekton_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be destroyed
  # (because kubernetes_secret.terraform_executor is not in configuration)
  - resource "kubernetes_secret" "terraform_executor" {
      - data                           = (sensitive value)
      - id                             = "default/terraform-executor" -> null
      - immutable                      = false -> null
      - type                           = "kubernetes.io/service-account-token" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/service-account.name" = "terraform-executor"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "156951514" -> null
          - uid              = "4e5d471e-2e95-42ea-9d2e-88f95c593061" -> null
        }
    }

  # module.tekton_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor will be destroyed
  # (because kubernetes_service_account.terraform_executor is not in configuration)
  - resource "kubernetes_service_account" "terraform_executor" {
      - automount_service_account_token = true -> null
      - id                              = "default/terraform-executor" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "156951508" -> null
          - uid              = "4c5c30a3-944b-450e-a833-bb9128c1cacf" -> null
        }
    }

  # module.terraform_executor_gcp_service_account.google_project_iam_member.terraform_executor_owner will be destroyed
  # (because google_project_iam_member.terraform_executor_owner is not in configuration)
  - resource "google_project_iam_member" "terraform_executor_owner" {
      - etag    = "BwX+pK6Sluk=" -> null
      - id      = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - project = "sap-kyma-prow" -> null
      - role    = "roles/owner" -> null
    }

  # module.terraform_executor_gcp_service_account.google_service_account.terraform_executor will be destroyed
  # (because google_service_account.terraform_executor is not in configuration)
  - resource "google_service_account" "terraform_executor" {
      - account_id   = "terraform-executor" -> null
      - description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity." -> null
      - disabled     = false -> null
      - display_name = "terraform-executor" -> null
      - email        = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - id           = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - name         = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - project      = "sap-kyma-prow" -> null
      - unique_id    = "103850067121674389188" -> null
    }

  # module.terraform_executor_gcp_service_account.google_service_account_iam_binding.terraform_workload_identity will be destroyed
  # (because google_service_account_iam_binding.terraform_workload_identity is not in configuration)
  - resource "google_service_account_iam_binding" "terraform_workload_identity" {
      - etag               = "BwX+pK5Qx+c=" -> null
      - id                 = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> null
      - members            = [
          - "serviceAccount:sap-kyma-prow.svc.id.goog[default/terraform-executor]",
        ] -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - '--name=*'\n          - '--config=*'\n          - '--context=*'\n          - '--dockerfile=*'\n          - --log-dir=/\n      - image: \"gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\"\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image"] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccountTrustedUsage"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "terraform-executor-sa-trusted-usage"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: ServiceAccountTrustedUsage
            metadata:
              name: terraform-executor-sa-trusted-usage
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedServiceAccounts:
                - image-builder
                trustedImages:
                - args:
                  - -wait_file
                  - /tekton/downward/ready
                  - -wait_file_content
                  - -post_file
                  - /tekton/run/0/out
                  - -termination_path
                  - /tekton/termination
                  - -step_metadata_dir
                  - /tekton/run/0/status
                  - -entrypoint
                  - /image-builder
                  - --
                  - --name=*
                  - --config=*
                  - --context=*
                  - --dockerfile=*
                  - --log-dir=/
                  command:
                  - /tekton/bin/entrypoint
                  image: eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*
                - command:
                  - /ko-app/entrypoint
                  - init
                  - /ko-app/entrypoint
                  - /tekton/bin/entrypoint
                  - step-build-image
                  image: gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be destroyed
  # (because kubernetes_secret.terraform_executor is not in configuration)
  - resource "kubernetes_secret" "terraform_executor" {
      - data                           = (sensitive value)
      - id                             = "default/terraform-executor" -> null
      - immutable                      = false -> null
      - type                           = "kubernetes.io/service-account-token" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/service-account.name" = "terraform-executor"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "613225574" -> null
          - uid              = "010a72b1-5a7f-46c6-9b83-7de76e11d2b0" -> null
        }
    }

  # module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor will be destroyed
  # (because kubernetes_service_account.terraform_executor is not in configuration)
  - resource "kubernetes_service_account" "terraform_executor" {
      - automount_service_account_token = true -> null
      - id                              = "default/terraform-executor" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "613225441" -> null
          - uid              = "05758180-7aea-40e1-a56b-e8c8e0ffbede" -> null
        }
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor-sa-trusted-usage\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - image-builder\n    trustedImages:\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tekton/bin/entrypoint\n        args:\n          - -wait_file\n          - /tekton/downward/ready\n          - -wait_file_content\n          - -post_file\n          - /tekton/run/0/out\n          - -termination_path\n          - /tekton/termination\n          - -step_metadata_dir\n          - /tekton/run/0/status\n          - -entrypoint\n          - /image-builder\n          - --\n          - '--name=*'\n          - '--config=*'\n          - '--context=*'\n          - '--dockerfile=*'\n          - --log-dir=/\n      - image: \"gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*\"\n        command:\n          - /ko-app/entrypoint\n          - init\n          - /ko-app/entrypoint\n          - /tekton/bin/entrypoint\n          - step-build-image"] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccountTrustedUsage"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "terraform-executor-sa-trusted-usage"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: ServiceAccountTrustedUsage
            metadata:
              name: terraform-executor-sa-trusted-usage
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
              parameters:
                restrictedServiceAccounts:
                - image-builder
                trustedImages:
                - args:
                  - -wait_file
                  - /tekton/downward/ready
                  - -wait_file_content
                  - -post_file
                  - /tekton/run/0/out
                  - -termination_path
                  - /tekton/termination
                  - -step_metadata_dir
                  - /tekton/run/0/status
                  - -entrypoint
                  - /image-builder
                  - --
                  - --name=*
                  - --config=*
                  - --context=*
                  - --dockerfile=*
                  - --log-dir=/
                  command:
                  - /tekton/bin/entrypoint
                  image: eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*
                - command:
                  - /ko-app/entrypoint
                  - init
                  - /ko-app/entrypoint
                  - /tekton/bin/entrypoint
                  - step-build-image
                  image: gcr.io/tekton-releases/github.com/tektoncd/pipeline/cmd/entrypoint:*
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_secret.terraform_executor will be destroyed
  # (because kubernetes_secret.terraform_executor is not in configuration)
  - resource "kubernetes_secret" "terraform_executor" {
      - data                           = (sensitive value)
      - id                             = "default/terraform-executor" -> null
      - immutable                      = false -> null
      - type                           = "kubernetes.io/service-account-token" -> null
      - wait_for_service_account_token = true -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/service-account.name" = "terraform-executor"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "609170015" -> null
          - uid              = "aca41ca8-6786-473d-a20b-9a66bb357b8e" -> null
        }
    }

  # module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor will be destroyed
  # (because kubernetes_service_account.terraform_executor is not in configuration)
  - resource "kubernetes_service_account" "terraform_executor" {
      - automount_service_account_token = true -> null
      - id                              = "default/terraform-executor" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "terraform-executor" -> null
          - namespace        = "default" -> null
          - resource_version = "609169953" -> null
          - uid              = "7421ea17-2d20-463e-ab19-078c924130a4" -> null
        }
    }

Plan: 13 to add, 0 to change, 10 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

```



<!-- github-comment: {"Command":"plan","PRNumber":7883,"Program":"tfcmt","SHA1":"d7391166bf2f015abcc42d6483df287b52d7f93e","Vars":{}} -->